{
  "backend/main.mo": "Main Motoko actor defining store management types (StoreSector, StockItem, Product, Supplier, Delivery, UserProfile) and implementing CRUD operations for user profiles, store creation, sectors, products, suppliers, and deliveries with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping three high-confidence features (critical error fix, store initialization verification, GameScene rendering) to their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files covering authentication, game simulation, rendering, UI components, hooks, and mobile-optimized layouts with error handling.",
  "frontend/index.css": "Empty global CSS file (content truncated or not present).",
  "frontend/index.html": "HTML entry point with viewport meta tag, title 'HIPER SUPERMERCADO MANAGER', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component orchestrating authentication flow, profile setup dialog, title screen, and game scene transitions with error boundaries and loading states.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component catching render errors and displaying a mobile-friendly error card with reload button and optional custom fallback.",
  "frontend/src/components/LoginButton.tsx": "Reusable authentication button handling Internet Identity login/logout with query cache clearing and error recovery for duplicate authentication attempts.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for first-time user profile creation with name and store name inputs, mobile-optimized with ScrollArea and minimum 44px tap targets.",
  "frontend/src/components/StoreInitializer.tsx": "Component managing async store initialization by creating store, adding all sectors and products with progress tracking, error handling, and graceful fallback to game even on partial failure.",
  "frontend/src/features/about/AboutDialog.tsx": "Modal dialog displaying game information and copyright notice for ITA Games Studios with Info icon trigger button.",
  "frontend/src/features/sectors/sectorConstants.ts": "Defines sector metadata (name, icon, color, description) for 17 supermarket departments (Produce, Butcher, Fish, etc.) and provides a lookup function to retrieve sector definitions by name.",
  "frontend/src/features/sectors/SectorsPanel.tsx": "React component that displays a panel of store sectors with cards showing sector details (icon, quality, stock, value, staff, cleanliness) and a scrollable table of stock items for each sector.",
  "frontend/src/game/data/initialProducts.ts": "Exports an array of 24 initial products with properties (productId, name, baseCost, sellPrice, sector, shelfLife) distributed across all 17 store sectors.",
  "frontend/src/game/GameHUD.tsx": "React component rendering the game's heads-up display with top bar (funds, reputation, day counter, pause/speed controls) and bottom bar (sector management, delivery, and analytics buttons using Sheet components).",
  "frontend/src/game/GameScene.tsx": "Main game scene component that handles store initialization, loads sector data, and renders the GameCanvas and GameHUD within an error boundary.",
  "frontend/src/game/render/GameCanvas.tsx": "Canvas-based rendering component that draws the store layout (grid, outline, entrance, checkout area) and animates customers at ~30 FPS with responsive scaling and device pixel ratio handling.",
  "frontend/src/game/sim/initialState.ts": "Factory function that creates the initial game state with default values (tick 0, empty customers/employees arrays, 100% cleanliness, 3.0 reputation).",
  "frontend/src/game/sim/types.ts": "TypeScript type definitions for game simulation including GameState, Customer (with position, type, satisfaction), and Employee (with position, role, productivity, fatigue).",
  "frontend/src/game/sim/useGameSimulation.ts": "React hook that manages game simulation loop with pause/speed controls, updates customer positions each tick, and spawns new customers periodically (every 60 ticks, max 20 customers).",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence via AuthClient, and delegation validation with configurable options for idle handling and identity providers.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating game data (user profiles, store, sectors, products, funds, reputation, deliveries) with type definitions for store entities; includes placeholder implementations for unfinished backend methods.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, safe area insets for mobile devices, and utility classes for touch-friendly UI elements and viewport handling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/TitleScreen.tsx": "Title screen component displaying game logo, start button (disabled until authenticated), login button, and about dialog with responsive mobile-friendly layout.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routing, persisting them in sessionStorage, and clearing sensitive parameters from the URL after extraction.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, custom screens, border radius, animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for a Facebook-style supermarket game tracking critical loading/opening issues, three existing features related to store initialization and GameScene rendering, and one pending backend authentication fix request."
}