{
  "backend/main.mo": "Motoko canister defining store management types, authorization, user profiles, and creation/update operations for stores, sectors, products, and deliveries.",
  "feature_evidence.json": "Feature evidence report mapping mobile‑responsiveness and HUD improvements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Reference file listing short summaries for all major frontend components, hooks, game systems, and styles.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "HTML entry file that sets up the root React mount point and loads the main TypeScript bundle.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup flow, title screen, and transition to the game scene.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button integrating Internet Identity authentication and clearing query cache on logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog for creating a user profile with form validation and mobile‑friendly layout.",
  "frontend/src/components/StoreInitializer.tsx": "Automated store setup component that creates the store, adds all sectors and products, and shows progress feedback.",
  "frontend/src/features/about/AboutDialog.tsx": "About dialog showing game information and copyright notice with a simple modal UI.",
  "frontend/src/features/sectors/sectorConstants.ts": "Defines sector metadata including icons and descriptions, and provides a helper to fetch definitions by name.",
  "frontend/src/features/sectors/SectorsPanel.tsx": "Renders a panel listing each sector with stock, value, staff, and cleanliness using fetched sector data.",
  "frontend/src/game/data/initialProducts.ts": "Provides a static list of initial products with pricing, sectors, and shelf-life data.",
  "frontend/src/game/GameHUD.tsx": "Displays top and bottom HUD elements showing funds, reputation, time, controls, and a sectors panel toggle.",
  "frontend/src/game/GameScene.tsx": "Initializes store state, loads sector data, and renders the main game canvas with the HUD once ready.",
  "frontend/src/game/render/GameCanvas.tsx": "Draws the game scene on a canvas, handling resizing, scaling, grid rendering, and customer visualization.",
  "frontend/src/game/sim/initialState.ts": "Creates the starting game state with default values for time, customers, employees, and cleanliness.",
  "frontend/src/game/sim/types.ts": "Defines TypeScript interfaces for game state, customers, and employees.",
  "frontend/src/game/sim/useGameSimulation.ts": "Runs the game loop, advancing time, moving customers, and periodically spawning new ones based on tick rate.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, store sectors, products, funds, reputation, and deliveries.",
  "frontend/src/index.css": "Sets up Tailwind base styles, theme variables, dark mode, safe-area utilities, and mobile-friendly layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/TitleScreen.tsx": "Renders the title screen UI with a start button, login button, and about dialog atop a styled background.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, screens, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the game’s high-level project state, including vision, architecture notes, and a list of implemented features for the browser-based tycoon game. Captures versioning, issues, and core systems already planned or built."
}