{
  "backend/main.mo": "Main Motoko actor implementing store management backend with authorization, user profiles, store state (sectors, products, suppliers, deliveries), and CRUD operations for sectors, products, and stock management.",
  "feature_evidence.json": "Feature evidence report documenting implementation of 4 requirements: displaying 17 store sectors with icons, rendering products with stock levels, interactive sector selection, and visual representation of shelves/aisles.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, game simulation, rendering system, and mobile-optimized UI with OKLCH color system and safe-area support.",
  "frontend/index.css": "Empty global CSS file (styles are defined in frontend/src/index.css instead).",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for React application titled 'HIPER SUPERMERCADO MANAGER'.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup dialog, title screen, and game scene transitions with error boundaries and theme provider.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches errors and displays a fallback UI with reload button and error message.",
  "frontend/src/components/LoginButton.tsx": "Reusable authentication button component handling Internet Identity login/logout with query cache clearing on logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog for new user profile creation with name and store name inputs, mobile-optimized with ScrollArea and minimum 44px tap targets.",
  "frontend/src/components/StoreInitializer.tsx": "Store initialization component that creates store, adds all 17 sectors and initial products with progress tracking, error handling, and graceful failure recovery.",
  "frontend/src/features/about/AboutDialog.tsx": "A dialog component that displays information about the HIPER SUPERMERCADO MANAGER game, including game description and copyright notice from ITA Games Studios.",
  "frontend/src/features/sectors/sectorConstants.ts": "Defines sector metadata (name, icon, color, description) for all 17 supermarket departments and provides a lookup function.",
  "frontend/src/features/sectors/SectorsPanel.tsx": "Displays a list of all store sectors with their metrics (stock, value, staff, cleanliness) in card format, including a scrollable table of products per sector.",
  "frontend/src/game/components/SectorDetailSheet.tsx": "A bottom sheet component that displays detailed metrics and product lists for a selected sector, including quality, stock value, staff, and cleanliness.",
  "frontend/src/game/data/initialProducts.ts": "Defines the initial product catalog with 24 products across all sectors, including product IDs, names, costs, sell prices, and shelf life.",
  "frontend/src/game/data/sectorLayout.ts": "Defines the 2D grid layout positions for all 17 sectors in the supermarket (12x8 grid) and provides functions to look up sectors by name or screen coordinates.",
  "frontend/src/game/GameHUD.tsx": "Renders the game's heads-up display showing funds, reputation, day counter, play/pause controls, speed settings, and navigation buttons for sectors, deliveries, and staff panels.",
  "frontend/src/game/GameScene.tsx": "Main game scene component that handles store initialization, loads sectors, and renders the game canvas with HUD overlay.",
  "frontend/src/game/render/assetLoader.ts": "Manages loading and caching of game image assets (tilesets, sprites, UI icons) with promise-based loading to prevent duplicate requests.",
  "frontend/src/game/render/GameCanvas.tsx": "Main React component that renders the game canvas, handles asset loading, canvas resizing, click/touch interactions for sector selection, and orchestrates the rendering loop for aisles, sectors, and products.",
  "frontend/src/game/render/renderAisles.ts": "Renders the store floor using a repeating tile pattern and draws aisle lines (vertical and horizontal corridors) between sectors.",
  "frontend/src/game/render/renderProducts.ts": "Draws product indicators within their assigned sectors, distributing them in a grid layout with names displayed when scale is sufficient.",
  "frontend/src/game/render/renderSectors.ts": "Renders sector backgrounds with color-coded fills, borders, fixture representations (shelves/counters/refrigerators), icons, and names.",
  "frontend/src/game/sim/initialState.ts": "Factory function that creates the initial game state with default values for tick, time, customers, employees, cleanliness, and reputation.",
  "frontend/src/game/sim/types.ts": "TypeScript type definitions for GameState, Customer, and Employee entities with their properties.",
  "frontend/src/game/sim/useGameSimulation.ts": "React hook that manages game simulation loop with pause/speed controls, updates customer positions, and spawns new customers periodically.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor with authentication, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, store data, sectors, products, funds, and reputation, with some functions returning mock data where backend methods are not yet implemented.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light/dark modes), safe area insets for mobile devices, and utility classes for touch-friendly UI elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the DOM root.",
  "frontend/src/pages/TitleScreen.tsx": "Title screen component displaying the game logo, start button (disabled until authenticated), login button, and about dialog with authentication checks before starting the game.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, responsive breakpoints, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata tracking four existing features related to displaying and interacting with 17 store sectors and products on an interactive store floor canvas."
}