{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add visible sectors and products to store floor",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Display all 17 store sectors as visible elements on the store floor canvas with icons and names",
      "acceptanceCriteria": [
        "Each sector appears as a labeled area on the store floor grid",
        "Sector icons from sectorConstants.ts are rendered for each department",
        "Sector names are clearly visible",
        "Sectors are positioned logically within the store layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Extend the canvas rendering to draw sector areas within the store grid. Use the generated tileset assets (frontend/public/assets/generated/hsm-tileset.dim_2048x2048.png and frontend/public/assets/generated/department-counters.dim_1024x1024.png) to render sector backgrounds and department fixtures. Position all 17 sectors from sectorConstants.ts in a logical supermarket layout (e.g., Produce near entrance, Frozen/Dairy along back wall, Checkout near exit). Render sector icons and names as text labels over each sector area. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/game/render/renderSectors.ts",
          "operation": "create",
          "description": "Create a utility module that renders sector areas on the canvas context. Accept canvas context, sector data from backend, and grid dimensions. For each of the 17 sectors, draw a background rectangle with the sector's color from sectorConstants.ts, render the sector icon using the hsm-ui-icons tileset (frontend/public/assets/generated/hsm-ui-icons.dim_1024x1024.png), and draw the sector name as text. Handle responsive scaling and device pixel ratio. Export a drawSectors function that GameCanvas can call during its render loop."
        },
        {
          "path": "frontend/src/game/render/assetLoader.ts",
          "operation": "create",
          "description": "Create an asset loader utility that preloads and caches the generated image assets (hsm-tileset.dim_2048x2048.png, department-counters.dim_1024x1024.png, hsm-ui-icons.dim_1024x1024.png, aisle-shelves-tileset.dim_1024x1024.png) as HTMLImageElement instances. Provide a loadAssets function that returns a Promise resolving to an asset map. Export getter functions for each asset. This ensures images are ready before rendering begins."
        },
        {
          "path": "frontend/src/game/GameScene.tsx",
          "operation": "modify",
          "description": "Import and call the asset loader before rendering GameCanvas. Show a loading state while assets are being loaded. Pass loaded assets to GameCanvas as props so the rendering logic can access the tileset images."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Render products within their assigned sectors showing names and stock levels",
      "acceptanceCriteria": [
        "Products from initialProducts.ts appear within their corresponding sector areas",
        "Product names are visible on shelves or display areas",
        "Stock levels or quantity indicators are shown for each product",
        "Products are distributed across all 24 items and 17 sectors as defined in initialProducts.ts"
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/renderProducts.ts",
          "operation": "create",
          "description": "Create a utility module that renders products within sector areas on the canvas. Accept canvas context, product data from backend (matching initialProducts.ts structure), and sector position data. For each product, determine its sector from sectorConstants.ts, calculate a position within that sector's area (distribute products across shelves), draw a small product icon or rectangle, render the product name as text, and display a stock level badge/indicator. Use the aisle-shelves-tileset asset (frontend/public/assets/generated/aisle-shelves-tileset.dim_1024x1024.png) to draw shelf backgrounds for products. Export a drawProducts function."
        },
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Integrate the drawProducts function into the canvas render loop. Fetch product data using the useGetProducts hook from useQueries.ts and pass it to the rendering function. Ensure products are drawn after sector areas but before customers so they appear layered correctly. Handle loading and error states for product data."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the useGetProducts hook properly fetches all product data including stock levels from the backend. Verify the hook returns products matching the initialProducts.ts structure with productId, name, sector, and current stock quantity. If backend returns stock data separately, merge it with product metadata in the hook."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make the store floor interactive with tap/click to view sector details",
      "acceptanceCriteria": [
        "Tapping a sector on the canvas opens a detail view or overlay",
        "Sector details display quality, stock, value, staff, and cleanliness metrics",
        "Mobile-optimized touch targets (minimum 44px) for sector selection",
        "Visual feedback when selecting a sector"
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Add touch and click event handlers to the canvas element. On tap/click, convert screen coordinates to canvas grid coordinates accounting for scaling and device pixel ratio. Determine which sector was tapped by checking if the coordinates fall within any sector's rendered area. If a sector is hit, store the selected sector ID in component state and trigger a visual highlight effect (draw an outline or overlay on the selected sector). Ensure touch targets meet the 44px minimum by expanding hitbox areas if needed."
        },
        {
          "path": "frontend/src/game/components/SectorDetailSheet.tsx",
          "operation": "create",
          "description": "Create a Sheet component that displays detailed information for a selected sector. Accept a sectorId prop and use useGetSector hook to fetch quality, stock value, staff count, and cleanliness metrics. Display this data in a mobile-friendly layout similar to the SectorsPanel component's sector cards. Include sector icon, name, and all metrics with clear labels. Add a close button to dismiss the sheet. Use shadcn/ui Sheet component for consistent mobile drawer behavior with minimum 44px tap targets."
        },
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Import and render the SectorDetailSheet component adjacent to the canvas. Pass the selected sector ID from canvas state to the sheet. Control the sheet's open state based on whether a sector is selected. When the sheet closes, clear the selected sector state and remove the visual highlight from the canvas."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add visual representation of shelves, aisles, and product displays",
      "acceptanceCriteria": [
        "Shelving units are drawn within sector areas",
        "Aisles between sectors are clearly visible for customer movement",
        "Product displays (refrigerators, freezers, bakery cases) are rendered appropriately for each sector type",
        "Visual distinction between different types of display fixtures"
      ],
      "file_operations": [
        {
          "path": "frontend/src/game/render/renderSectors.ts",
          "operation": "modify",
          "description": "Enhance the sector rendering to include shelving units and specialized displays. For each sector, draw appropriate fixtures using the department-counters tileset (frontend/public/assets/generated/department-counters.dim_1024x1024.png): refrigerators for Dairy/Frozen, counters for Butcher/Fish/Bakery, standard shelves for other departments using aisle-shelves-tileset (frontend/public/assets/generated/aisle-shelves-tileset.dim_1024x1024.png). Position fixtures to leave aisle space between sectors. Use different tileset regions for different fixture types to create visual distinction."
        },
        {
          "path": "frontend/src/game/render/renderAisles.ts",
          "operation": "create",
          "description": "Create a utility module that draws aisle pathways on the canvas. Calculate aisle positions as the negative space between sector areas. Draw aisle floor tiles using the supermarket-floor tileset (frontend/public/assets/generated/supermarket-floor.dim_512x512.png). Ensure aisles are wide enough for customer sprite movement (reference the customers-sprites asset frontend/public/assets/generated/customers-sprites.dim_1024x1024.png for scale). Export a drawAisles function that GameCanvas calls before drawing sectors so aisles appear as background."
        },
        {
          "path": "frontend/src/game/render/GameCanvas.tsx",
          "operation": "modify",
          "description": "Integrate the drawAisles function into the render loop. Call it after drawing the base grid but before drawing sectors and products. This creates a proper layering where floor -> aisles -> sectors -> shelves -> products -> customers. Ensure the rendering order maintains visual hierarchy."
        },
        {
          "path": "frontend/src/game/data/sectorLayout.ts",
          "operation": "create",
          "description": "Define a layout configuration that maps each of the 17 sectors to specific grid positions and dimensions on the store floor. Include fixture type metadata (shelf, counter, refrigerator) for each sector based on sectorConstants.ts definitions. Export a SECTOR_LAYOUT constant that rendering utilities can reference to position sectors consistently. This separates layout logic from rendering logic for easier maintenance."
        }
      ]
    }
  ]
}